## Staging: common
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 7 to add, 0 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Bulk saving are being created but are not being processed fast enough. Difference > 100"
      + alarm_name                            = "bulk-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "bulk_created"
          + label       = "Bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created" = "True"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "bulk_processed"
          + label       = "Bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(bulk_created - bulk_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "bulk-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Bulk saving are being created but are not being processed fast enough. Difference > 50"
      + alarm_name                            = "bulk-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "bulk_created"
          + label       = "Bulk created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created" = "True"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "bulk_processed"
          + label       = "Bulk processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                }
              + metric_name = "batch_saving_bulk"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(bulk_created - bulk_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "inflights-not-being-processed-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Batch saving inflights are being created but are not being processed fast enough. Difference > 100"
      + alarm_name                            = "inflights-not-being-processed-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "inflight_created"
          + label       = "Inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created" = "True"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "inflight_processed"
          + label       = "Inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(inflight_created - inflight_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "inflights-not-being-processed-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Batch saving inflights are being created but are not being processed fast enough. Difference > 50"
      + alarm_name                            = "inflights-not-being-processed-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "inflight_created"
          + label       = "Inflight created"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "created" = "True"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "inflight_processed"
          + label       = "Inflight processed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "acknowledged" = "True"
                }
              + metric_name = "batch_saving_inflight"
              + namespace   = "NotificationCanadaCa"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(inflight_created - inflight_processed)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = true
        }
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5533389431466631271" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1646337747045420000" -> "1646341526105952000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_general.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7444364694410088460" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1646337743349222800" -> "1646341522914581000"
            # (1 unchanged element hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4150068790735981591" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1646337747100581800" -> "1646341525887070000"
            # (1 unchanged element hidden)
        }
    }

Plan: 7 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-sns-delivery-receipts-errors-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.live-service-over-daily-rate-limit-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.no-emails-sent-5-minutes-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-bounce-rate-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-bounce-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-complaint-rate-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ses-complaint-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sign-in-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-blocked-as-spam-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-blocked-as-spam-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-phone-carrier-unavailable-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-rate-exceeded-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-rate-exceeded-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-us-west-2-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-sms-success-rate-canadian-numbers-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-us-west-2-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-us-west-2-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sns-spending-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-bulk-queue-delay-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-db-tasks-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-email-queue-delay-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-email-queue-delay-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-send-throttled-sms-tasks-receive-rate-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.sqs-throttled-sms-stuck-in-queue-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.notification-canada-ca-natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.iam_lambda_to_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sns-delivery-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.bulk_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.inspec-scanner"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.notification-canada-ca-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ses_receiving_emails"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ses_to_sqs_email_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.sns_to_sqs_sms_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.notification-canada-ca[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_pinpoint_app.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.dns_query_log_config"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.notification-canada-ca-public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.alb_log_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.asset_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.athena_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.athena_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.bulk_send"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.bulk_send_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.csv_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.csv_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.document_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.document_bucket_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-critical-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-general"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-alert-warning-us-west-2"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.notification-canada-ca-ses-callback"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-private[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_subnet.notification-canada-ca-public[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_general.module.lambda.aws_lambda_function.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.aws_cloudwatch_log_group.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_iam_policy.additional_json[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_iam_role.lambda[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]"]

120 tests, 8 passed, 112 warnings, 0 failures, 0 exceptions

```

</details>
